---
kind: property
id: P:Autodesk.Revit.DB.GroupSet.IsEmpty
source: html/c9cc2ee2-9a39-097e-8b20-378431f9b9d4.htm
---
# Autodesk.Revit.DB.GroupSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.